khoih-prog/ESP8266_AT_WebServer/src/utility/ESP8266_AT_Drv.cpp
/****************************************************************************************************************************
   ESP8266_AT_Drv.cpp - Dead simple web-server.
   For ESP8266/ESP32 AT-command running shields

   ESP8266_AT_WebServer is a library for the ESP8266/ESP32 AT-command shields to run WebServer
   Forked and modified from ESP8266 https://github.com/esp8266/Arduino/releases
   Built by Khoi Hoang https://github.com/khoih-prog/ESP8266_AT_WebServer
   Licensed under MIT license
   Version: 1.0.7

   Version Modified By   Date      Comments
   ------- -----------  ---------- -----------
    1.0.0   K Hoang      12/02/2020 Initial coding for Arduino Mega, Teensy, etc
    1.0.1   K Hoang      17/02/2020 Add support to server's lambda function calls
    1.0.2   K Hoang      22/02/2020 Add support to SAMD (DUE, ZERO, MKR, NANO_33_IOT, M0, Mo Pro, AdaFruit, etc) boards
    1.0.3   K Hoang      03/03/2020 Add support to STM32 (STM32,F0,F1, F2, F3, F4, F7, etc) boards
    1.0.4   K Hoang      19/03/2020 Fix bug. Sync with ESP8266WebServer library of core v2.6.3
    1.0.5   K Hoang      17/04/2020 Add support to SAMD51 and SAM DUE boards
    1.0.6   K Hoang      11/06/2020 Add support to nRF52 boards, such as AdaFruit Feather nRF52832, nRF52840 Express, BlueFruit Sense, 
                                    Itsy-Bitsy nRF52840 Express, Metro nRF52840 Express, NINA_B30_ublox, etc. 
    1.0.7   K Hoang      23/06/2020 Add support to ESP32-AT. Update deprecated ESP8266-AT commands. Restructure examples.  
 *****************************************************************************************************************************/

#include <Arduino.h>
#include <avr/pgmspace.h>

#if    ( defined(ARDUINO_SAMD_ZERO) || defined(ARDUINO_SAMD_MKR1000) || defined(ARDUINO_SAMD_MKRWIFI1010) \
      || defined(ARDUINO_SAMD_NANO_33_IOT) || defined(ARDUINO_SAMD_MKRFox1200) || defined(ARDUINO_SAMD_MKRWAN1300) || defined(ARDUINO_SAMD_MKRWAN1310) \
      || defined(ARDUINO_SAMD_MKRGSM1400) || defined(ARDUINO_SAMD_MKRNB1500) || defined(ARDUINO_SAMD_MKRVIDOR4000) || defined(__SAMD21G18A__) \
      || defined(ARDUINO_SAMD_CIRCUITPLAYGROUND_EXPRESS) || defined(__SAMD21E18A__) || defined(__SAMD51__) || defined(__SAMD51J20A__) || defined(__SAMD51J19A__) \
      || defined(__SAMD51G19A__) || defined(__SAMD21G18A__) )
#if defined(ESP8266_AT_USE_SAMD)
#undef ESP8266_AT_USE_SAMD
#endif
#define ESP8266_AT_USE_SAMD      true
#warning Use SAMD architecture from ESP8266_AT_Drv_h
#endif

#if ( defined(NRF52840_FEATHER) || defined(NRF52832_FEATHER) || defined(NRF52_SERIES) || defined(ARDUINO_NRF52_ADAFRUIT) || \
      defined(NRF52840_FEATHER_SENSE) || defined(NRF52840_ITSYBITSY) || defined(NRF52840_CIRCUITPLAY) || defined(NRF52840_CLUE) || \
      defined(NRF52840_METRO) || defined(NRF52840_PCA10056) || defined(PARTICLE_XENON) || defined(NINA_B302_ublox) || defined(NINA_B112_ublox) )
#if defined(ESP8266_AT_USE_NRF528XX)
#undef ESP8266_AT_USE_NRF528XX
#endif
#define ESP8266_AT_USE_NRF528XX      true
#warning Use nFR52 architecture from ESP8266_AT_WebServer
#endif

#if ( defined(ARDUINO_SAM_DUE) || defined(__SAM3X8E__) )
#if defined(ESP8266_AT_USE_SAM_DUE)
#undef ESP8266_AT_USE_SAM_DUE
#endif
#define ESP8266_AT_USE_SAM_DUE      true
#endif

#if (ESP8266_AT_USE_SAMD || ESP8266_AT_USE_SAM_DUE || ESP8266_AT_USE_NRF528XX)
#include <cstdarg>
#define vsnprintf_P vsnprintf
#endif

#include "utility/ESP8266_AT_Drv.h"
#include "utility/ESP8266_AT_Debug.h"


#define NUMESPTAGS 5

const char* ESPTAGS[] =
{
  "\r\nOK\r\n",
  "\r\nERROR\r\n",
  "\r\nFAIL\r\n",
  "\r\nSEND OK\r\n",
  " CONNECT\r\n"
};

typedef enum
{
  TAG_OK,
  TAG_ERROR,
  TAG_FAIL,
  TAG_SENDOK,
  TAG_CONNECT
} TagsEnum;


Stream *ESP8266_AT_Drv::espSerial;

#ifdef CORE_TEENSY
//AT_RingBuffer ESP8266_AT_Drv::ringBuf(4096);
AT_RingBuffer ESP8266_AT_Drv::ringBuf(512);
//AT_RingBuffer ESP8266_AT_Drv::ringBuf(256);
#else
//AT_RingBuffer ESP8266_AT_Drv::ringBuf(32);
//AT_RingBuffer ESP8266_AT_Drv::ringBuf(256);
AT_RingBuffer ESP8266_AT_Drv::ringBuf(512);
#endif

// Array of data to cache the information related to the networks discovered
char 	  ESP8266_AT_Drv::_networkSsid[][WL_SSID_MAX_LENGTH]    = {{"1"}, {"2"}, {"3"}, {"4"}, {"5"}};
int32_t ESP8266_AT_Drv::_networkRssi[WL_NETWORKS_LIST_MAXNUM] = { 0 };
uint8_t ESP8266_AT_Drv::_networkEncr[WL_NETWORKS_LIST_MAXNUM] = { 0 };

// Cached values of retrieved data
char    ESP8266_AT_Drv::_ssid[] = {0};
uint8_t ESP8266_AT_Drv::_bssid[] = {0};
uint8_t ESP8266_AT_Drv::_mac[] = {0};
uint8_t ESP8266_AT_Drv::_localIp[] = {0};
char    ESP8266_AT_Drv::fwVersion[] = {0};

long    ESP8266_AT_Drv::_bufPos = 0;
uint8_t ESP8266_AT_Drv::_connId = 0;

uint16_t  ESP8266_AT_Drv::_remotePort  = 0;
uint8_t   ESP8266_AT_Drv::_remoteIp[] = {0};


void ESP8266_AT_Drv::wifiDriverInit(Stream *espSerial)
{
  LOGDEBUG(F("> wifiDriverInit"));

  ESP8266_AT_Drv::espSerial = espSerial;

  bool initOK = false;

  for (int i = 0; i < 5; i++)
  {
    if (sendCmd("AT") == TAG_OK)
    {
      initOK = true;
      break;
    }
    delay(1000);
  }

  if (!initOK)
  {
    LOGERROR(F("Cannot initialize ESP module"));
    delay(5000);
    return;
  }

  reset();

  // check firmware version
  getFwVersion();

  // prints a warning message if the firmware is not 1.X or 2.X
  if ((fwVersion[0] != '1' and fwVersion[0] != '2') or
      fwVersion[1] != '.')
  {
    LOGWARN1(F("Warning: Unsupported firmware"), fwVersion);
    delay(4000);
  }
  else
  {
    LOGINFO1(F("Initilization successful -"), fwVersion);
  }
}

void ESP8266_AT_Drv::reset()
{
  LOGDEBUG(F("> reset"));

  sendCmd("AT+RST");
  delay(3000);
  espEmptyBuf(false);  // empty dirty characters from the buffer

  // disable echo of commands
  sendCmd("ATE0");

  // set station mode
  if (useESP32_AT)
  {
    LOGERROR(F("Use ESP32-AT Command"));
    sendCmd("AT+CWMODE=1");
  }
  else
  {
    LOGERROR(F("Use ES8266-AT Command"));
    sendCmd("AT+CWMODE_CUR=1");
  }
    
  delay(200);

  // set multiple connections mode
  sendCmd("AT+CIPMUX=1");

  // Show remote IP and port with "+IPD"
  sendCmd("AT+CIPDINFO=1");

