khoih-prog/ESP8266_AT_WebServer/src/utility/ESP8266_AT_Drv.cpp
  // Disable autoconnect
  // Automatic connection can create problems during initialization phase at next boot
  sendCmd("AT+CWAUTOCONN=0");

  // enable DHCP
  if (useESP32_AT)
    sendCmd("AT+CWDHCP=1,1");
  else
    sendCmd("AT+CWDHCP_CUR=1,1");

  delay(200);
}

bool ESP8266_AT_Drv::wifiConnect(const char* ssid, const char* passphrase)
{
  LOGDEBUG(F("> wifiConnect"));

  // TODO
  // Escape character syntax is needed if "SSID" or "password" contains
  // any special characters (',', '"' and '/')

  // connect to access point, use CUR mode to avoid connection at boot
  int ret = sendCmd("AT+CWJAP_CUR=\"%s\",\"%s\"", 20000, ssid, passphrase);

  if (ret == TAG_OK)
  {
    LOGINFO1(F("Connected to"), ssid);
    return true;
  }

  LOGWARN1(F("Failed connecting to"), ssid);

  // clean additional messages logged after the FAIL tag
  delay(1000);
  espEmptyBuf(false);

  return false;
}

bool ESP8266_AT_Drv::wifiStartAP(const char* ssid, const char* pwd, uint8_t channel, uint8_t enc, uint8_t espMode)
{
  LOGDEBUG(F("> wifiStartAP"));

  // set AP mode, use CUR mode to avoid automatic start at boot
  int ret;
  
  if (useESP32_AT)
    ret = sendCmd("AT+CWMODE=%d", 10000, espMode);
  else
    ret = sendCmd("AT+CWMODE_CUR=%d", 10000, espMode);
    
  if (ret != TAG_OK)
  {
    LOGWARN1(F("Failed to set AP mode"), ssid);
    return false;
  }

  // TODO
  // Escape character syntax is needed if "SSID" or "password" contains
  // any special characters (',', '"' and '/')

  // start access point
  if (useESP32_AT)
    ret = sendCmd("AT+CWSAP=\"%s\",\"%s\",%d,%d", 10000, ssid, pwd, channel, enc);
  else
    ret = sendCmd("AT+CWSAP_CUR=\"%s\",\"%s\",%d,%d", 10000, ssid, pwd, channel, enc);

  if (ret != TAG_OK)
  {
    LOGWARN1(F("Failed to start AP"), ssid);
    return false;
  }

  if (espMode == 2)
  {
    if (useESP32_AT)
      sendCmd("AT+CWDHCP=1,2");         // enable DHCP for AP mode
    else
      sendCmd("AT+CWDHCP_CUR=0,1");     // enable DHCP for AP mode
  }   
  else if (espMode == 3)
  {
    if (useESP32_AT)
      sendCmd("AT+CWDHCP=1,3");         // enable DHCP for station and AP mode
    else
      sendCmd("AT+CWDHCP_CUR=2,1");     // enable DHCP for station and AP mode
  }

  LOGINFO1(F("Access point started"), ssid);
  return true;
}

int8_t ESP8266_AT_Drv::disconnect()
{
  LOGDEBUG(F("> disconnect"));

  if (sendCmd("AT+CWQAP") == TAG_OK)
    return WL_DISCONNECTED;

  // wait and clear any additional message
  delay(2000);
  espEmptyBuf(false);

  return WL_DISCONNECTED;
}

void ESP8266_AT_Drv::config(IPAddress ip)
{
  LOGDEBUG(F("> config"));

  // disable station DHCP
  if (useESP32_AT)
  {
    //KH, AT+CWDHCP=<operate>,<mode>
    sendCmd("AT+CWDHCP=0,0");
  }
  else
  {
    // KH, AT+CWDHCP=<<mode>,<en>
    sendCmd("AT+CWDHCP_CUR=1,0");
  }

  // it seems we need to wait here...
  delay(500);

  char buf[16];
  //sprintf_P(buf, PSTR("%d.%d.%d.%d"), ip[0], ip[1], ip[2], ip[3]);
  sprintf(buf, "%d.%d.%d.%d", ip[0], ip[1], ip[2], ip[3]);

  int ret;
  
  if (useESP32_AT)
  {
    // Set STA IP address
    ret = sendCmd("AT+CIPSTA=\"%s\"", 2000, buf);
  }
  else
  {
    // Set STA IP address
    ret = sendCmd("AT+CIPSTA_CUR=\"%s\"", 2000, buf);
  }
   
  delay(500);

  if (ret == TAG_OK)
  {
    LOGINFO1(F("IP address set"), buf);
  }
}

void ESP8266_AT_Drv::configAP(IPAddress ip)
{
  LOGDEBUG(F("> config"));
  
  if (useESP32_AT)
  {
    // SoftAP Mode
    sendCmd("AT+CWMODE=2");
    //KH, AT+CWDHCP=<operate>,<mode>
    // disable AP and STA DHCP
    sendCmd("AT+CWDHCP=0,3");
  }
  else
  {
    // SoftAP Mode
    sendCmd("AT+CWMODE_CUR=2");
    // KH, AT+CWDHCP=<<mode>,<en>
    // disable AP and STA DHCP
    sendCmd("AT+CWDHCP_CUR=2,0");
  } 

  // it seems we need to wait here...
  delay(500);

  char buf[16];
  //sprintf_P(buf, PSTR("%d.%d.%d.%d"), ip[0], ip[1], ip[2], ip[3]);
  sprintf(buf, "%d.%d.%d.%d", ip[0], ip[1], ip[2], ip[3]);
  
  int ret;
  
  if (useESP32_AT)
  {
    // Set AP IP address
    ret = sendCmd("AT+CIPAP=\"%s\"", 2000, buf);
  }
  else
  {
    // Set AP IP address
    ret = sendCmd("AT+CIPAP_CUR=\"%s\"", 2000, buf);
  }
  
  delay(500);

  if (ret == TAG_OK)
  {
    LOGINFO1(F("IP address set"), buf);
  }
}

uint8_t ESP8266_AT_Drv::getConnectionStatus()
{
  LOGDEBUG(F("> getConnectionStatus"));

  /*
  	AT+CIPSTATUS

  	Response

  		STATUS:<stat>
  		+CIPSTATUS:<link ID>,<type>,<remote_IP>,<remote_port>,<local_port>,<tetype>

  	Parameters

  		<stat>
  			2: Got IP
  			3: Connected
  			4: Disconnected
  		<link ID> ID of the connection (0~4), for multi-connect
  		<type> string, "TCP" or "UDP"
  		<remote_IP> string, remote IP address.
  		<remote_port> remote port number
  		<local_port> ESP8266 local port number
  		<tetype>
  			0: ESP8266 runs as client
  			1: ESP8266 runs as server
  */

  char buf[10];
  if (!sendCmdGet("AT+CIPSTATUS", "STATUS:", "\r\n", buf, sizeof(buf)))
    return WL_NO_SHIELD;

  // 4: client disconnected
  // 5: wifi disconnected
  int s = atoi(buf);
  if (s == 2 or s == 3 or s == 4)
    return WL_CONNECTED;
  else if (s == 5)
    return WL_DISCONNECTED;

  return WL_IDLE_STATUS;
}

uint8_t ESP8266_AT_Drv::getClientState(uint8_t sock)
{
  LOGDEBUG1(F("> getClientState"), sock);

  char findBuf[20];
  //sprintf_P(findBuf, PSTR("+CIPSTATUS:%d,"), sock);
  sprintf(findBuf, "+CIPSTATUS:%d,", sock);

  char buf[10];
  if (sendCmdGet("AT+CIPSTATUS", findBuf, ",", buf, sizeof(buf)))
  {
    LOGDEBUG(F("Connected"));
    return true;
  }

  LOGDEBUG(F("Not connected"));
  return false;
}

uint8_t* ESP8266_AT_Drv::getMacAddress()
{
  LOGDEBUG(F("> getMacAddress"));

  memset(_mac, 0, WL_MAC_ADDR_LENGTH);

  char buf[20];
  if (sendCmdGet("AT+CIFSR", ":STAMAC,\"", "\"", buf, sizeof(buf)))
  {
    char* token;

    token = strtok(buf, ":");
    _mac[5] = (byte)strtol(token, NULL, 16);
    token = strtok(NULL, ":");
    _mac[4] = (byte)strtol(token, NULL, 16);
    token = strtok(NULL, ":");
    _mac[3] = (byte)strtol(token, NULL, 16);
    token = strtok(NULL, ":");
    _mac[2] = (byte)strtol(token, NULL, 16);
    token = strtok(NULL, ":");
    _mac[1] = (byte)strtol(token, NULL, 16);
    token = strtok(NULL, ":");
    _mac[0] = (byte)strtol(token, NULL, 16);
  }
  return _mac;
}

void ESP8266_AT_Drv::getIpAddress(IPAddress& ip)
{
  LOGDEBUG(F("> getIpAddress"));

  char buf[20];
  memset(buf, '\0', sizeof(buf));
  if (sendCmdGet("AT+CIFSR", ":STAIP,\"", "\"", buf, sizeof(buf)))
  {
    char* token;

    token = strtok(buf, ".");
    _localIp[0] = atoi(token);
    token = strtok(NULL, ".");
    _localIp[1] = atoi(token);
    token = strtok(NULL, ".");
    _localIp[2] = atoi(token);
    token = strtok(NULL, ".");
    _localIp[3] = atoi(token);

    ip = _localIp;
  }
}

void ESP8266_AT_Drv::getIpAddressAP(IPAddress& ip)
{
  LOGDEBUG(F("> getIpAddressAP"));

  char buf[20];
  memset(buf, '\0', sizeof(buf));
  
