khoih-prog/ESP8266_AT_WebServer/src/utility/ESP8266_AT_Drv.cpp
  bool ret;
  
  if (useESP32_AT)
  {
    // Get AP IP address
    ret = sendCmdGet("AT+CIPAP?", "+CIPAP:ip:\"", "\"", buf, sizeof(buf));
  }
  else
  {
    // Get AP IP address
    // _CUR not working here ???
    //ret = sendCmdGet("AT+CIPAP_CUR?", "+CIPAP:ip:\"", "\"", buf, sizeof(buf));
    ret = sendCmdGet("AT+CIPAP?", "+CIPAP:ip:\"", "\"", buf, sizeof(buf));
  }
  
  if (ret)
  {
    char* token;

    token = strtok(buf, ".");
    _localIp[0] = atoi(token);
    token = strtok(NULL, ".");
    _localIp[1] = atoi(token);
    token = strtok(NULL, ".");
    _localIp[2] = atoi(token);
    token = strtok(NULL, ".");
    _localIp[3] = atoi(token);

    ip = _localIp;
  }
}

char* ESP8266_AT_Drv::getCurrentSSID()
{
  LOGDEBUG(F("> getCurrentSSID"));

  _ssid[0] = 0;
  
  if (useESP32_AT)
  {
    // Get AP Info
    sendCmdGet("AT+CWJAP?", "+CWJAP:\"", "\"", _ssid, sizeof(_ssid));
  }
  else
  {
    // Get AP Info
    sendCmdGet("AT+CWJAP_CUR?", "+CWJAP:\"", "\"", _ssid, sizeof(_ssid));
  }
  
  return _ssid;
}

uint8_t* ESP8266_AT_Drv::getCurrentBSSID()
{
  LOGDEBUG(F("> getCurrentBSSID"));

  memset(_bssid, 0, WL_MAC_ADDR_LENGTH);

  char buf[20];
  
  bool ret;
  
  if (useESP32_AT)
  {
    // Get AP Info
    ret = sendCmdGet("AT+CWJAP?", ",\"", "\",", buf, sizeof(buf));
  }
  else
  {
    // Get AP Info
    ret = sendCmdGet("AT+CWJAP_CUR?", ",\"", "\",", buf, sizeof(buf));
  }
  
  if (ret)
  {
    char* token;

    token = strtok(buf, ":");
    _bssid[5] = (byte)strtol(token, NULL, 16);
    token = strtok(NULL, ":");
    _bssid[4] = (byte)strtol(token, NULL, 16);
    token = strtok(NULL, ":");
    _bssid[3] = (byte)strtol(token, NULL, 16);
    token = strtok(NULL, ":");
    _bssid[2] = (byte)strtol(token, NULL, 16);
    token = strtok(NULL, ":");
    _bssid[1] = (byte)strtol(token, NULL, 16);
    token = strtok(NULL, ":");
    _bssid[0] = (byte)strtol(token, NULL, 16);
  }
  return _bssid;

}

int32_t ESP8266_AT_Drv::getCurrentRSSI()
{
  LOGDEBUG(F("> getCurrentRSSI"));

  int ret = 0;
  char buf[10];
  
  if (useESP32_AT)
  {
    // Get AP Info
    sendCmdGet("AT+CWJAP?", ",-", "\r\n", buf, sizeof(buf));
  }
  else
  {
    // Get AP Info
    sendCmdGet("AT+CWJAP_CUR?", ",-", "\r\n", buf, sizeof(buf));
  }
  
  if (isDigit(buf[0])) {
    ret = -atoi(buf);
  }

  return ret;
}

uint8_t ESP8266_AT_Drv::getScanNetworks()
{
  uint8_t ssidListNum = 0;
  int idx;

  espEmptyBuf();

  LOGDEBUG(F("----------------------------------------------"));
  LOGDEBUG(F(">> AT+CWLAP"));

  espSerial->println("AT+CWLAP");

  idx = readUntil(10000, "+CWLAP:(");
  
  //Serial.printf("idx = %d, NUMESPTAGS = %d\n", idx, NUMESPTAGS);

  while (idx == NUMESPTAGS)
  {
    _networkEncr[ssidListNum] = espSerial->parseInt();
    
    //Serial.printf("_networkEncr[%d] = %d\n", ssidListNum, _networkEncr[ssidListNum]);

    // discard , and " characters
    readUntil(1000, "\"");

    idx = readUntil(1000, "\"", false);
    if (idx == NUMESPTAGS)
    {
      memset(_networkSsid[ssidListNum], 0, WL_SSID_MAX_LENGTH );
      ringBuf.getStrN(_networkSsid[ssidListNum], 1, WL_SSID_MAX_LENGTH - 1);
    }

    // discard , character
    readUntil(1000, ",");

    _networkRssi[ssidListNum] = espSerial->parseInt();
    //Serial.printf("_networkEncr[%d] = %d\n", ssidListNum, _networkRssi[ssidListNum]);

    idx = readUntil(1000, "+CWLAP:(");

    if (ssidListNum == WL_NETWORKS_LIST_MAXNUM - 1)
      break;

    ssidListNum++;
  }

  if (idx == -1)
    return -1;

  LOGDEBUG1(F("---------------------------------------------- >"), ssidListNum);
  LOGDEBUG();
  return ssidListNum;
}

bool ESP8266_AT_Drv::getNetmask(IPAddress& mask) {
  LOGDEBUG(F("> getNetmask"));

  char buf[20];
  
  bool ret;
  
  if (useESP32_AT)
  {
    // Get STA IP Info
    ret = sendCmdGet("AT+CIPSTA?", "+CIPSTA:netmask:\"", "\"", buf, sizeof(buf));
  }
  else
  {
    // Get STA IP Info
    ret = sendCmdGet("AT+CIPSTA_CUR?", "+CIPSTA:netmask:\"", "\"", buf, sizeof(buf));
  }
  
  if (ret)
  {
    mask.fromString (buf);
    return true;
  }

  return false;
}

bool ESP8266_AT_Drv::getGateway(IPAddress& gw)
{
  LOGDEBUG(F("> getGateway"));

  char buf[20];
  
  bool ret;
  
  if (useESP32_AT)
  {
    // Get STA IP Info
    ret = sendCmdGet("AT+CIPSTA?", "+CIPSTA:gateway:\"", "\"", buf, sizeof(buf));
  }
  else
  {
    // Get STA IP Info
    ret = sendCmdGet("AT+CIPSTA?", "+CIPSTA:gateway:\"", "\"", buf, sizeof(buf));
  }
  
  if (ret)
  {
    gw.fromString (buf);
    return true;
  }

  return false;
}

char* ESP8266_AT_Drv::getSSIDNetoworks(uint8_t networkItem)
{
  if (networkItem >= WL_NETWORKS_LIST_MAXNUM)
    return NULL;

  return _networkSsid[networkItem];
}

uint8_t ESP8266_AT_Drv::getEncTypeNetowrks(uint8_t networkItem)
{
  if (networkItem >= WL_NETWORKS_LIST_MAXNUM)
    return 0;

  return _networkEncr[networkItem];
}

int32_t ESP8266_AT_Drv::getRSSINetoworks(uint8_t networkItem)
{
  if (networkItem >= WL_NETWORKS_LIST_MAXNUM)
    return 0;

  return _networkRssi[networkItem];
}

char* ESP8266_AT_Drv::getFwVersion()
{
  LOGDEBUG(F("> getFwVersion"));

  fwVersion[0] = 0;

  sendCmdGet("AT+GMR", "SDK version:", "\r\n", fwVersion, sizeof(fwVersion));

  return fwVersion;
}

bool ESP8266_AT_Drv::ping(const char *host)
{
  LOGDEBUG(F("> ping"));

  int ret = sendCmd("AT+PING=\"%s\"", 8000, host);

  if (ret == TAG_OK)
    return true;

  return false;
}

// Start server TCP on port specified
bool ESP8266_AT_Drv::startServer(uint16_t port, uint8_t sock)
{
  LOGDEBUG1(F("> startServer"), port);

  int ret = sendCmd("AT+CIPSERVER=%d,%d", 1000, sock, port);

  return ret == TAG_OK;
}

bool ESP8266_AT_Drv::startClient(const char* host, uint16_t port, uint8_t sock, uint8_t protMode)
{
  LOGDEBUG2(F("> startClient"), host, port);

  // TCP
  // AT+CIPSTART=<link ID>,"TCP",<remote IP>,<remote port>

  // UDP
  // AT+CIPSTART=<link ID>,"UDP",<remote IP>,<remote port>[,<UDP local port>,<UDP mode>]

  // for UDP we set a dummy remote port and UDP mode to 2
  // this allows to specify the target host/port in CIPSEND


  int ret = -1;
  if (protMode == TCP_MODE)
    ret = sendCmd("AT+CIPSTART=%d,\"TCP\",\"%s\",%u", 5000, sock, host, port);
  else if (protMode == SSL_MODE)
  {
    // better to put the CIPSSLSIZE here because it is not supported before firmware 1.4
    if (!useESP32_AT)
    {
      // Set SSL Buffer to 4K, only for ESP8266
      sendCmd("AT+CIPSSLSIZE=4096");
    }    
    
