khoih-prog/ESP8266_AT_WebServer/src/utility/ESP8266_AT_Drv.cpp
    ret = sendCmd("AT+CIPSTART=%d,\"SSL\",\"%s\",%u", 5000, sock, host, port);
  }
  else if (protMode == UDP_MODE)
    ret = sendCmd("AT+CIPSTART=%d,\"UDP\",\"%s\",0,%u,2", 5000, sock, host, port);

  return ret == TAG_OK;
}

// Start server TCP on port specified
void ESP8266_AT_Drv::stopClient(uint8_t sock)
{
  LOGDEBUG1(F("> stopClient"), sock);

  sendCmd("AT+CIPCLOSE=%d", 4000, sock);
}

uint8_t ESP8266_AT_Drv::getServerState(uint8_t sock)
{
  return 0;
}

////////////////////////////////////////////////////////////////////////////
// TCP/IP functions
////////////////////////////////////////////////////////////////////////////



uint16_t ESP8266_AT_Drv::availData(uint8_t connId)
{
  //LOGDEBUG(bufPos);

  // if there is data in the buffer
  if (_bufPos > 0)
  {
    if (_connId == connId)
      return _bufPos;
    else if (_connId == 0)
      return _bufPos;
  }

  int bytes = espSerial->available();

  if (bytes)
  {
    //LOGDEBUG1(F("Bytes in the serial buffer: "), bytes);
    if (espSerial->find((char *)"+IPD,"))
    {
      // format is : +IPD,<id>,<len>:<data>
      // format is : +IPD,<ID>,<len>[,<remote IP>,<remote port>]:<data>

      _connId = espSerial->parseInt();    // <ID>
      espSerial->read();                  // ,
      _bufPos = espSerial->parseInt();    // <len>
      espSerial->read();                  // "
      _remoteIp[0] = espSerial->parseInt();    // <remote IP>
      espSerial->read();                  // .
      _remoteIp[1] = espSerial->parseInt();
      espSerial->read();                  // .
      _remoteIp[2] = espSerial->parseInt();
      espSerial->read();                  // .
      _remoteIp[3] = espSerial->parseInt();
      espSerial->read();                  // "
      espSerial->read();                  // ,
      _remotePort = espSerial->parseInt();     // <remote port>

      espSerial->read();                  // :

      LOGDEBUG();
      LOGDEBUG2(F("Data packet"), _connId, _bufPos);

      if (_connId == connId || connId == 0)
        return _bufPos;
    }
  }
  return 0;
}

bool ESP8266_AT_Drv::getData(uint8_t connId, uint8_t *data, bool peek, bool* connClose)
{
  if (connId != _connId)
    return false;

  // see Serial.timedRead

  long _startMillis = millis();
  do
  {
    if (espSerial->available())
    {
      if (peek)
      {
        *data = (char)espSerial->peek();
      }
      else
      {
        *data = (char)espSerial->read();
        _bufPos--;
      }

      // KH
      //if ( _bufPos == 293 )
      //Serial.println((char)*data);


      if (_bufPos == 0)
      {
        // after the data packet a ",CLOSED" string may be received
        // this means that the socket is now closed

        delay(5);

        if (espSerial->available())
        {
          //LOGDEBUG(".2");
          //LOGDEBUG(espSerial->peek());

          // 48 = '0'
          if (espSerial->peek() == 48 + connId)
          {
            int idx = readUntil(500, ",CLOSED\r\n", false);
            if (idx != NUMESPTAGS)
            {
              LOGERROR(F("Tag CLOSED not found"));
            }

            LOGDEBUG();
            LOGDEBUG(F("Connection closed"));

            *connClose = true;
          }
        }
      }

      return true;
    }
  } while (millis() - _startMillis < 500 /*2000*/);

  // timed out, reset the buffer
  LOGERROR1(F("TIMEOUT:"), _bufPos);

  _bufPos = 0;
  _connId = 0;
  *data = 0;

  return false;
}

/**
   Receive the data into a buffer.
   It reads up to bufSize bytes.
   @return	received data size for success else -1.
*/
int ESP8266_AT_Drv::getDataBuf(uint8_t connId, uint8_t *buf, uint16_t bufSize)
{
  if (connId != _connId)
    return false;

  if (_bufPos < bufSize)
    bufSize = _bufPos;

  for (uint16_t i = 0; i < bufSize; i++)
  {
    int c = timedRead();
    //LOGDEBUG(c);
    if (c == -1)
      return -1;

    buf[i] = (char)c;
    _bufPos--;
  }

  // KH
  LOGDEBUG2(F("> getDataBuf:"), bufSize, (char*)buf);

  return bufSize;
}

bool ESP8266_AT_Drv::sendData(uint8_t sock, const uint8_t *data, uint16_t len)
{
  //LOGERROR1(F("AT_Drv::sendData1: socket"), sock);
  //LOGERROR1(F("AT_Drv::sendData1: len"), len);
  //LOGERROR1(F("AT_Drv::sendData1: data"), (char*) data);

  char cmdBuf[20];
  //sprintf_P(cmdBuf, PSTR("AT+CIPSEND=%d,%u"), sock, len);
  sprintf(cmdBuf, "AT+CIPSEND=%d,%u", sock, len);
  espSerial->println(cmdBuf);

  int idx = readUntil(1000, (char *)">", false);
  if (idx != NUMESPTAGS)
  {
    //LOGERROR(F("Data packet send error (1)"));
    return false;
  }

  espSerial->write(data, len);

  idx = readUntil(2000);
  if (idx != TAG_SENDOK)
  {
    //LOGERROR(F("Data packet send error (2)"));
    return false;
  }

  return true;
}

// Overrided sendData method for __FlashStringHelper strings
bool ESP8266_AT_Drv::sendData(uint8_t sock, const __FlashStringHelper *data, uint16_t len, bool appendCrLf)
{
  LOGDEBUG2(F("> sendData2:"), sock, len);

  char cmdBuf[20];
  uint16_t len2 = len + 2 * appendCrLf;
  //sprintf_P(cmdBuf, PSTR("AT+CIPSEND=%d,%u"), sock, len2);
  sprintf(cmdBuf, "AT+CIPSEND=%d,%u", sock, len2);
  espSerial->println(cmdBuf);

  int idx = readUntil(1000, (char *)">", false);
  if (idx != NUMESPTAGS)
  {
    //LOGERROR(F("Data packet send error (1)"));
    return false;
  }

  //espSerial->write(data, len);
  PGM_P p = reinterpret_cast<PGM_P>(data);
  for (uint16_t i = 0; i < len; i++)
  {
    unsigned char c = pgm_read_byte(p++);
    espSerial->write(c);
  }
  if (appendCrLf)
  {
    espSerial->write('\r');
    espSerial->write('\n');
  }

  idx = readUntil(2000);
  if (idx != TAG_SENDOK)
  {
    //LOGERROR(F("Data packet send error (2)"));
    return false;
  }

  return true;
}

bool ESP8266_AT_Drv::sendDataUdp(uint8_t sock, const char* host, uint16_t port, const uint8_t *data, uint16_t len)
{
  LOGDEBUG2(F("> sendDataUdp:"), sock, len);
  LOGDEBUG2(F("> sendDataUdp:"), host, port);

  char cmdBuf[40];
  //sprintf_P(cmdBuf, PSTR("AT+CIPSEND=%d,%u,\"%s\",%u"), sock, len, host, port);
  sprintf(cmdBuf, "AT+CIPSEND=%d,%u,\"%s\",%u", sock, len, host, port);
  //LOGDEBUG1(F("> sendDataUdp:"), cmdBuf);
  espSerial->println(cmdBuf);

  int idx = readUntil(1000, (char *)">", false);
  if (idx != NUMESPTAGS)
  {
    //LOGERROR(F("Data packet send error (1)"));
    return false;
  }

  espSerial->write(data, len);

  idx = readUntil(2000);
  if (idx != TAG_SENDOK)
  {
    //LOGERROR(F("Data packet send error (2)"));
    return false;
  }

